Repository: OmarAhmedIbrahim/Family_
Catalog: lib/l10n/intl_*.arb
Languages: ar

# title
source: Welcome
ar: مرحبا

# appGoal
source: Unite your family through the blessed words of Allah
ar: جمع عائلتك حول كلمات الله المباركة

# appDescription
source: Track your family's Quran reading journey together, assign daily readings, and celebrate milestones as one united family
ar: تتبع رحلة قراءة القرآن الكريم لعائلتك معًا، وحدد قراءات يومية، واحتفل بالإنجازات كعائلة واحدة متحدة

# begin
source: Begin now
ar: ابدا الآن

# join
source: Join thousands of families reading the Quran together
ar: انضم إلى آلاف العائلات التي تقرأ القرآن معًا

# start
source: Start Your Family's Journey Today
ar: ابدأ رحلة عائلتك اليوم

# welcome
source: Welcome To Your Family
ar: مرحبا بك و بعائلتك

# journey
source: How do you want to start your journey?
ar: كيف تريد أن تبدأ رحلتك؟

# create
source: Create a new family
ar: إنشاء عائلة جديدة

# invite
source: Start a new family group and invite members
ar: أَنْشِئْ عائلة جديدة

# admin
source: - Become the family admin
ar: - كن مسؤولاً عن عائلتك

# goals
source: - Set reading goals for your family
ar: - حدد أهداف القراءة لعائلتك

# manage
source: - Manage family members
ar: - قم بإضافة أفراد اسرتك

# track
source: - Track everyone's progress
ar: - تتبع قراءة الجميع

# existing
source: Join Existing Family
ar: انضم إلى عائلة موجودة بالفعل

# connect
source: Connect with your family group
ar: تواصل مع عائلتك

# code
source: - Enter your family code
ar: - أدخل الرمز

# get
source: - Get your daily reading assignment
ar: - احصل على مهمة القراءة اليومية الخاصة بك

# progrss
source: - Track your progress
ar: - تتبع التقدم المحرز

# together
source: - Read together as a family
ar: - القراءة معًا كعائلة

# buttonCreate
source: Start with your Family
ar: ابدأ مع عائلتك

# buttonJoin
source: Join Your Family
ar: انضم إلى عائلتك

# existingJoin
source: Join Your Family Now
ar: انضم إلى عائلتك الآن

# existingCode
source: Enter the family code to connect with your family group
ar: أدخل رمز العائلة للاتصال بمجموعة عائلتك

# existingFamilyCode
source: Family Code
ar: رمز العائلة

# existingAsk
source: Ask your family admin for the access code
ar: اطلب رمز الدخول من مسؤول العائلة

# existingEnter
source: Enter Family Code
ar: أدخل رمز العائلة

# startNewFamily_appBarTitle
source: Create Your Family
ar: إنشاء عائلتك

# startNewFamily_familySetup
source: Family Setup
ar: إعداد العائلة

# startNewFamily_description
source: Configure your family's Quran reading journey
ar: قم بتكوين رحلة قراءة القرآن لعائلتك

# startNewFamily_familyNameLabel
source: Family name
ar: اسم العائلة

# startNewFamily_enterFamilyNameHint
source: Enter Your Family Name
ar: أدخل اسم عائلتك

# startNewFamily_completeQuranReadingLabel
source: Complete Quran Reading (times per month)
ar: إكمال قراءة القرآن (مرات في الشهر)

# startNewFamily_readingTimesExample
source: e.g., 1, 2, 3
ar: مثال: 1، 2، 3

# startNewFamily_goalChangeNote
source: This goal can be changed anytime in settings
ar: يمكن تغيير هذا الهدف في أي وقت من الإعدادات

# startNewFamily_createButton
source: Create Family
ar: إنشاء العائلة

# setYourName_welcome
source: Welcome to Family Quran
ar: مرحبًا بك في عائلة القرآن

# setYourName_getToKnow
source: Let's get to know you
ar: دعنا نتعرف عليك اكثر

# setYourName_enterFullName
source: Enter your full name
ar: أدخل اسمك الكامل

# setYourName_firstNameHint
source: Enter your first name
ar: أدخل اسمك الأول

# setYourName_lastNameHint
source: Enter your last name
ar: أدخل اسم العائلة

# setYourName_emptyNameError
source: Please enter both first and last name
ar: الرجاء إدخال الاسم الأول واسم العائلة

# setYourName_continue
source: Continue
ar: متابعة
